# OverrideGraphicSettings Constructor (OverrideGraphicSettings) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
OverrideGraphicSettings Constructor (OverrideGraphicSettings)
OverrideGraphicSettings Class See Also
---
Creates a new instance of an OverrideGraphicSettings object based on an existing OverrideGraphicSettings object.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public OverrideGraphicSettings(
	OverrideGraphicSettings overrideGraphicSettings
)
```

Visual Basic
---
```text
Public Sub New ( _
	overrideGraphicSettings As OverrideGraphicSettings _
)
```

Visual C++
---
```text
public:
OverrideGraphicSettings(
	OverrideGraphicSettings^ overrideGraphicSettings
)
```

# ### Parameters
overrideGraphicSettings
    Type: Autodesk.Revit.DB..::..OverrideGraphicSettings
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
OverrideGraphicSettings Class
OverrideGraphicSettings Overload
Autodesk.Revit.DB Namespace